МП/src/InformationRegisters/ПрикрепленныеФайлы/ПрикрепленныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрикрепленныеФайлы</name>
  <resources>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ЭлементыДоски</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МП/src/InformationRegisters/ПрикрепленныеФайлы/Forms/ФормаЗаписи/Module.bsl
//&НаКлиенте
//Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)//Ден  2016 11 05
	//ВыборФайла();
//КонецПроцедуры

//&НаКлиенте
//Процедура ВыборФайла()//Ден  2016 11 05 ---
	//ДиалогОткрытияФайла = Новый ДиалогВыбораФайла;
	//ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	//Если ДиалогОткрытияФайла.Выбрать() Тогда
	//	файлДляИмени = новый Файл(ДиалогОткрытияФайла.ПолноеИмяФайла);
	//	запись.Представление = файлДляИмени.ИмяБезРасширения;
	//	запись.ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
	//	#Если МобильноеПриложениеКлиент Тогда	
	//		этаформа.ТекущийЭлемент = элементы.Представление;
	//		НачатьРедактированиеЭлемента();
	//	#КонецЕсли
	//КонецЕсли;
//КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФайл(Команда)//Ден  2016 11 05
	Если запись.ПутьКФайлу <> "" Тогда
		ЗапуститьПриложение(запись.ПутьКФайлу);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура УдалитьНаСервере()//Ден  2016 11 05
	МенЗап = РегистрыСведений.ПрикрепленныеФайлы.СоздатьМенеджерЗаписи();
	МенЗап.Элемент = запись.Элемент;
	МенЗап.Представление = запись.Представление;
	МенЗап.Удалить();
КонецПроцедуры


&НаКлиенте
Процедура Удалить(Команда)//Ден  2016 11 05
	УдалитьНаСервере();
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура СделатьФото(Команда)//Ден  2016 11 23 ---
	#Если МобильноеПриложениеКлиент Тогда
		ДанныеМультимедиа = СредстваМультимедиа.СделатьФотоснимок();
		Если ДанныеМультимедиа <> Неопределено Тогда
			СоздатьНовыйФайл(ДанныеМультимедиа.ПолучитьДвоичныеДанные(), ДанныеМультимедиа.РасширениеФайла, ДанныеМультимедиа.ТипСодержимого);	
			этаформа.ТекущийЭлемент = элементы.Представление;
			НачатьРедактированиеЭлемента();
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаСервере
Процедура СоздатьНовыйФайл(Данные, Расширение, Тип)	
	ТипСодержимого = Тип;
	Номер = Найти(ТипСодержимого, "/");
	Если Номер > 0 Тогда
		ТипСодержимого = Лев(ТипСодержимого, Номер - 1);	
	КонецЕсли;	
	Файл = Новый Файл("storage/sdcard1/" + "ТЕСТ"  + "." + Расширение);
	Данные.Записать(Файл);
	
	запись.Представление = Файл.ИмяБезРасширения;
	запись.ПутьКФайлу = Файл.ПолноеИмяФайла;
	
КонецПроцедуры
//---
